---
kind: property
id: P:Autodesk.Revit.DB.FormArray.Item(System.Int32)
source: html/d7bb9cb5-35c3-ac07-4e53-5001a1adaa96.htm
---
# Autodesk.Revit.DB.FormArray.Item Property

Gets or sets a form at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Form this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the form to be set or retrieved.

## Returns
Returns the form at the specified index.